#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать gitrunner
#Использовать "../src"

#Область ОписаниеПеременных

Перем юТест;
Перем Лог;
Перем МенеджерВременныхФайлов;
Перем РепозиторийGit;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает список тестов сценария
//
// Параметры:
//	ЮнитТестирование - Модуль - модуль юнит-тестов
//
// Возвращаемое значение:
//	Массив из Строка - массив имен методов
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    юТест = ЮнитТестирование;

    ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийВставкиКопирайта");
	ВсеТесты.Добавить("ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийРазбораОбычныхФорм");
	ВсеТесты.Добавить("ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийРазбораОтчетовОбработокРасширений");
	
	Возврат ВсеТесты;
КонецФункции

// Выполняет инициализацию переменных модуля перед запуском теста
Процедура ПередЗапускомТеста() Экспорт
	
	МенеджерПриложения.Инициализировать(ПараметрыПриложения);

	ВремТестер	= Новый Тестер;
	Лог 		= Логирование.ПолучитьЛог(ВремТестер.ИмяЛога());
	
	ВключитьПоказОтладки();

	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов;
КонецПроцедуры

// Выполняет очистку данных после запуска теста
Процедура ПослеЗапускаТеста() Экспорт
	ВыключитьПоказОтладки();
	МенеджерВременныхФайлов.Удалить();
	МенеджерВременныхФайлов = Неопределено;
КонецПроцедуры

Процедура ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийВставкиКопирайта() Экспорт
	КаталогФикстур = КаталогТестовыхФикстур();
	Фикстура = ОбъединитьПути(КаталогФикстур, "ВыполнениеСценариев", "ВставкаКопирайта");

	ВременныйКаталог = ПодготовитьВременныйКаталог(Фикстура);
	ТаблицаФайлов = ТаблицаИзмененныхФайлов(ВременныйКаталог);
	НаборНастроек = НастройкиОбработки(ВременныйКаталог);
	ПараметрыОбработки = ПараметрыОбработки(ВременныйКаталог);

	Попытка
		СценарииОбработки.ВыполнитьОбработкуФайлов(ТаблицаФайлов, НаборНастроек, ПараметрыОбработки);
	Исключение
		ВызватьИсключение "Ошибка обработки файлов";
	КонецПопытки;

	ОчиститьКаталог(ВременныйКаталог);
КонецПроцедуры

Процедура ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийРазбораОбычныхФорм() Экспорт
	КаталогФикстур = КаталогТестовыхФикстур();
	Фикстура = ОбъединитьПути(КаталогФикстур, "ВыполнениеСценариев", "РазборОбычныхФормНаИсходники");

	ВременныйКаталог = ПодготовитьВременныйКаталог(Фикстура);
	ТаблицаФайлов = ТаблицаИзмененныхФайлов(ВременныйКаталог);
	НаборНастроек = НастройкиОбработки(ВременныйКаталог);
	ПараметрыОбработки = ПараметрыОбработки(ВременныйКаталог);

	Попытка
		СценарииОбработки.ВыполнитьОбработкуФайлов(ТаблицаФайлов, НаборНастроек, ПараметрыОбработки);
	Исключение
		ВызватьИсключение "Ошибка обработки файлов";
	КонецПопытки;

	ОчиститьКаталог(ВременныйКаталог);
КонецПроцедуры

Процедура ТестДолжен_ПодготовитьДанныеИВыполнитьСценарийРазбораОтчетовОбработокРасширений() Экспорт
	КаталогФикстур = КаталогТестовыхФикстур();
	Фикстура = ОбъединитьПути(КаталогФикстур, "ВыполнениеСценариев", "РазборОтчетовОбработокРасширений");

	ВременныйКаталог = ПодготовитьВременныйКаталог(Фикстура);
	ТаблицаФайлов = ТаблицаИзмененныхФайлов(ВременныйКаталог);
	НаборНастроек = НастройкиОбработки(ВременныйКаталог);
	ПараметрыОбработки = ПараметрыОбработки(ВременныйКаталог);

	Попытка
		СценарииОбработки.ВыполнитьОбработкуФайлов(ТаблицаФайлов, НаборНастроек, ПараметрыОбработки);
	Исключение
		ВызватьИсключение "Ошибка обработки файлов";
	КонецПопытки;

	ОчиститьКаталог(ВременныйКаталог);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВключитьПоказОтладки()
	Лог.УстановитьУровень(УровниЛога.Отладка);
КонецПроцедуры

Процедура ВыключитьПоказОтладки()
	Лог.УстановитьУровень(УровниЛога.Информация);
КонецПроцедуры

Процедура ОчиститьКаталог(Каталог)
	НайденныеФайлы = НайтиФайлы(Каталог, "*", Истина);
	Каталоги = Новый Массив;
	Файлы = Новый Массив;

	Для Каждого Файл Из НайденныеФайлы Цикл
		Если Файл.ЭтоКаталог() Тогда
			Каталоги.Добавить(Файл.ПолноеИмя);
		Иначе
			Файлы.Добавить(Файл.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Файл Из Файлы Цикл
		УдалитьФайл(Файл, "Ошибка удаления файла");
	КонецЦикла;

	Для Каждого Файл Из Каталоги Цикл
		УдалитьФайл(Файл, "Ошибка удаления каталога");
	КонецЦикла;

	УдалитьФайл(Каталог, "Ошибка удаления корневого каталога");
КонецПроцедуры

Процедура УдалитьФайл(Знач ИмяФайла, Знач СообщениеОбОшибке)
	Файл = ФайловыеОперации.НовыйФайл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;

	Если НЕ МенеджерВременныхФайлов.БезопасноУдалитьФайл(Файл.ПолноеИмя) Тогда
		ТекстОшибки = ОписаниеОшибки();
		Лог.Отладка("%1 `%2`: %3", СообщениеОбОшибке, Файл.ПолноеИмя, ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

Функция КаталогТестовыхФикстур() 
	Возврат ОбъединитьПути(КаталогИсходников(), "tests", "fixtures");
КонецФункции

Функция КаталогИсходников() 
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "..");
КонецФункции

Функция ПолучитьДополнительныеНастройки(Знач КаталогРепозитория = Неопределено, Знач ТекущийКаталогИсходныхФайлов = Неопределено)
	Если КаталогРепозитория = Неопределено Тогда
		КаталогРепозитория = ТекущийКаталог();
	КонецЕсли;
	
	УправлениеНастройками = МенеджерНастроек.НастройкиРепозитория(КаталогРепозитория, Ложь);
	Настройка = МенеджерНастроек.НастройкиПроекта().Получить("НастройкиСценариев");

	ДополнительныеНастройки = СценарииОбработки.ПолучитьСтандартныеПараметрыОбработки();
	ДополнительныеНастройки.Лог = Лог;
	ДополнительныеНастройки.КаталогРепозитория = КаталогРепозитория;
	ДополнительныеНастройки.ТекущийКаталогИсходныхФайлов = ТекущийКаталогИсходныхФайлов;
	ДополнительныеНастройки.Настройки = Настройка;
	
	Возврат ДополнительныеНастройки;
КонецФункции

Функция НастройкиОбработки(КаталогРепозитория)
	УправлениеНастройками = МенеджерНастроек.НастройкиРепозитория(КаталогРепозитория);
	Возврат СценарииОбработки.ПолучитьСценарииСПараметрамиВыполнения(КаталогРепозитория);
КонецФункции

Функция ПараметрыОбработки(КаталогРепозитория)
	ПараметрыОбработки = СценарииОбработки.ПолучитьСтандартныеПараметрыОбработки();
	ПараметрыОбработки.Лог = Лог;
	ПараметрыОбработки.КаталогРепозитория = КаталогРепозитория;
	ПараметрыОбработки.ТекущийКаталогИсходныхФайлов = КаталогРепозитория;
	ПараметрыОбработки.НастройкиИБ = МенеджерПриложения.ПолучитьНастройкиИБ();

	Возврат ПараметрыОбработки;
КонецФункции

Функция ПолучитьСценарий(ИмяСценария)
	Сценарий = ОбъединитьПути(КаталогИсходников(), "src", "СценарииОбработки", ИмяСценария);
	РасширениеФайла = ".os";
	Если Не СтрЗаканчиваетсяНа(Сценарий, РасширениеФайла) Тогда
		Сценарий = Сценарий + РасширениеФайла;
	КонецЕсли;
	ОбъектСценария = ЗагрузитьСценарий(Сценарий);
	
	Возврат ОбъектСценария;
КонецФункции

Функция РепозиторийGit(КаталогРепозитория = "")
	Если РепозиторийGit = Неопределено Тогда
		РепозиторийGit = Новый ГитРепозиторий;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(КаталогРепозитория) И РепозиторийGit.ПолучитьРабочийКаталог() <> КаталогРепозитория Тогда
		РепозиторийGit.УстановитьРабочийКаталог(КаталогРепозитория);
	КонецЕсли;

	Возврат РепозиторийGit;
КонецФункции

Функция ПодготовитьВременныйКаталог(Фикстура)
	ВременныйКаталог = МенеджерВременныхФайлов.СоздатьКаталог("test");	
	СоздатьКаталог(ВременныйКаталог);

	Репозиторий = РепозиторийGit(ВременныйКаталог);
	Репозиторий.Инициализировать();

	ФайловыеОперации.СкопироватьКаталог(Фикстура, ВременныйКаталог);

	Репозиторий.ДобавитьФайлВИндекс(".");

	Возврат ВременныйКаталог;
КонецФункции

Функция ТаблицаИзмененныхФайлов(КаталогРепозитория)
	ПараметрыКоманды = Новый Массив;
	ПараметрыКоманды.Добавить("diff --cached --name-status --no-renames");

	РепозиторийGit = РепозиторийGit(КаталогРепозитория);
	РепозиторийGit.ВыполнитьКоманду(ПараметрыКоманды);

	РезультатВывода = РепозиторийGit.ПолучитьВыводКоманды();
	СтрокиВывода = СтрРазделить(РезультатВывода, Символы.ПС);

	ТаблицаФайлов = СценарииОбработки.НоваяТаблицаОбрабатываемыхФайлов();
	Для Каждого СтрокаВывода Из СтрокиВывода Цикл
		Если ПустаяСтрока(СтрокаВывода) Тогда
			Продолжить;
		КонецЕсли;

		Данные = ВариантИзмененийФайловGit.РазделитьИмяФайлаИВариантИзменения(СтрокаВывода);
		ИмяФайла = ОбъединитьПути(КаталогРепозитория, СокрЛП(Данные.ИмяФайла));

		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.Файл = ФайловыеОперации.НовыйФайл(ИмяФайла);
		НоваяСтрока.Каталог = КаталогРепозитория;
		НоваяСтрока.ТипИзменения = Данные.ТипИзменения;
	КонецЦикла;
	
	Возврат ТаблицаФайлов;
КонецФункции

#КонецОбласти
