#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать "../src"

Перем юТест;
Перем Лог;
Перем МенеджерВременныхФайлов;

// Основная точка входа
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    юТест = ЮнитТестирование;

    ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПрочитатьФайл");
	ВсеТесты.Добавить("ТестДолжен_ЗаписатьФайл");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПрочитатьФайл() Экспорт
	
	ПутьКФайлу = ОбъединитьПути(КаталогТестовыхФикстур(), "NoBom.bsl");
	СодержимоеФайла = ФайловыеОперации.ПрочитатьТекстФайла(ПутьКФайлу);
	
	Утверждения.ПроверитьЗаполненность(СодержимоеФайла);

КонецПроцедуры

Процедура ТестДолжен_ЗаписатьФайл() Экспорт
	
	Файл			= Новый Файл(МенеджерВременныхФайлов.СоздатьФайл("bsl"));
	ФайловыеОперации.ЗаписатьТекстФайла(Файл.ПолноеИмя, Файл.ПолноеИмя);

	СодержимоеФайла	= ФайловыеОперации.ПрочитатьТекстФайла(Файл.ПолноеИмя);
	
	Утверждения.ПроверитьРавенство(СодержимоеФайла, Файл.ПолноеИмя);

КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
	ВремТестер	= Новый Тестер;
	Лог 		= Логирование.ПолучитьЛог(ВремТестер.ИмяЛога());
	
	ВключитьПоказОтладки();

	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов;
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	МенеджерВременныхФайлов.Удалить();
	МенеджерВременныхФайлов = Неопределено;

КонецПроцедуры


Процедура ВключитьПоказОтладки()
	Лог.УстановитьУровень(УровниЛога.Отладка);
КонецПроцедуры

Процедура ВыключитьПоказОтладки()
	Лог.УстановитьУровень(УровниЛога.Информация);
КонецПроцедуры

Функция КаталогТестовыхФикстур() 
	Возврат ОбъединитьПути(КаталогИсходников(), "tests\fixtures");
КонецФункции

Функция КаталогИсходников() 
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "..");
КонецФункции
