/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры-тесты
/////////////////////////////////////////////////////////////////////////////////

#Область ТестыAPI

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
// Параметры:
// 	ДополнительныеПараметры - Структура - Дополнительные параметры, используемые при формировании списка тестов
// Возвращаемое значение:
// 	Массив - Имена методов тестов
Функция ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт
	
	ИсполняемыеСценарии = Новый Массив;
	ИсполняемыеСценарии.Добавить("ПокрытаяПроцедураЭкспортнаяБезПараметров");
	Возврат ИсполняемыеСценарии;
	
КонецФункции

#КонецОбласти

#Область Тесты

// @unit-test:CommonModule
Процедура ПокрытаяПроцедураЭкспортнаяБезПараметров(Фреймворк, ВыполнитьВТранзакцииСОтменой = Истина) Экспорт
	
#Если Сервер Тогда
	Если ВыполнитьВТранзакцииСОтменой Тогда
		
		TestsWrapper.ВыполнитьТестВТранзакции(
			Метаданные.ОбщиеМодули.ОМ_ОбщийМодуль0,
			"ПокрытаяПроцедураЭкспортнаяБезПараметров",
			Фреймворк);
			
		Возврат;
		
	КонецЕсли;
#КонецЕсли
	
	ВызватьИсключение "Тест 'ОМ_ОбщийМодуль0.ПокрытаяПроцедураЭкспортнаяБезПараметров' не реализован";
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, составляющие внутреннюю реализацию модуля
/////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
