///////////////////////////////////////////////////////////////////////////////
//
// Служебный модуль-перечисление
//
// (с) BIA Technologies, LLC
//
///////////////////////////////////////////////////////////////////////////////

Перем Добавлен Экспорт;
Перем Изменен Экспорт;
Перем Удален Экспорт;
Перем Переименован Экспорт;
Перем Скопирован Экспорт;

///////////////////////////////////////////////////////////////////////////////

// ОпределитьВариантИзменения
//	Определяет вариант изменения файла из терминов git
//
// Параметры:
//  СимволИзменения  - Строка - Символ изменения файла из лога git
//
// Возвращаемое значение:
//   Строка   - Значение варианта изменения
//
Функция ОпределитьВариантИзменения(СимволИзменения) Экспорт
	
	Если СтрСравнить(СимволИзменения, "M") = 0 Тогда
		
		Возврат Изменен;
		
	ИначеЕсли СтрСравнить(СимволИзменения, "A") = 0 Тогда
		
		Возврат Добавлен;
		
	ИначеЕсли СтрСравнить(СимволИзменения, "D") = 0 Тогда
		
		Возврат Удален;
		
	ИначеЕсли СтрСравнить(СимволИзменения, "R") = 0 Тогда
		
		Возврат Переименован;

	ИначеЕсли СтрСравнить(СимволИзменения, "C") = 0 Тогда
		
		Возврат Скопирован;

	КонецЕсли;

	Возврат СимволИзменения;
	
КонецФункции

Функция РазделитьИмяФайлаИВариантИзменения(СтрокаИзменения) Экспорт
	Подстроки = СтрРазделить(СтрокаИзменения, Символы.Таб, Ложь);
	Если Подстроки.Количество() > 1 Тогда
		ТипИзменения = ОпределитьВариантИзменения(Подстроки[0]);
		ИмяФайла = Подстроки[1];

		Возврат Новый Структура("ТипИзменения, ИмяФайла", ТипИзменения, СокрЛП(ИмяФайла));
	Иначе
		ТекстОшибки = СтрШаблон("Строка изменений Git `%1` должна содержать тип изменения и имя файла", СтрокаИзменения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецФункции

///////////////////////////////////////////////////////////////////////////////

Добавлен = "Добавлен";
Изменен = "Изменен";
Удален = "Удален";
Переименован = "Переименован";
Скопирован = "Скопирован";
