///////////////////////////////////////////////////////////////////////////////
// 
// Служебный модуль с реализацией сценариев обработки файлов <ПроверкаНаличияАртефактовGit>
//
///////////////////////////////////////////////////////////////////////////////

Перем Лог;

// ИмяСценария
//	Возвращает имя сценария обработки файлов
//
// Возвращаемое значение:
//   Строка   - Имя текущего сценария обработки файлов
//
Функция ИмяСценария() Экспорт
	
	Возврат "ПроверкаНаличияАртефактовGit";
	
КонецФункции // ИмяСценария()

// ОбработатьФайл
//	Выполняет обработку файла
//
// Параметры:
//  АнализируемыйФайл		- Файл - Файл из журнала git для анализа
//  КаталогИсходныхФайлов  	- Строка - Каталог расположения исходных файлов относительно каталог репозитория
//  ДополнительныеПараметры - Структура - Набор дополнительных параметров, которые можно использовать 
//  	* Лог  					- Объект - Текущий лог
//  	* ИзмененныеКаталоги	- Массив - Каталоги, которые необходимо добавить в индекс
//		* КаталогРепозитория	- Строка - Адрес каталога репозитория
//		* ФайлыДляПостОбработки	- Массив - Файлы, изменившиеся / образовавшиеся в результате работы сценария
//											и которые необходимо дообработать
//
// Возвращаемое значение:
//   Булево   - Признак выполненной обработки файла
//
Функция ОбработатьФайл(АнализируемыйФайл, КаталогИсходныхФайлов, ДополнительныеПараметры) Экспорт
	
	Лог = ДополнительныеПараметры.Лог;
	НастройкиСценария = ДополнительныеПараметры.Настройки.Получить(ИмяСценария());
	Если АнализируемыйФайл.Существует() И АнализируемыйФайл.ЭтоФайл() Тогда
		
		Лог.Информация("Обработка файла '%1' по сценарию '%2'", АнализируемыйФайл.ПолноеИмя, ИмяСценария());
		
		ПроверитьНаНаличиеАртефактовGit(АнализируемыйФайл.ПолноеИмя);
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции // ОбработатьФайл()

Процедура ПроверитьНаНаличиеАртефактовGit(ПутьКФайлуМодуля)
	
	ПаттерныКонфликтов = Новый Массив();
	ПаттерныКонфликтов.Добавить("^<<<<<<<\s");
	ПаттерныКонфликтов.Добавить("^=======\s");
	ПаттерныКонфликтов.Добавить("^=======\n$");
	ПаттерныКонфликтов.Добавить("^=======\r\n$");
	ПаттерныКонфликтов.Добавить("^>>>>>>>\s");
	ТекстМодуля = ФайловыеОперации.ПрочитатьТекстФайла(ПутьКФайлуМодуля);

	Ошибки = Новый Массив;
	Если НЕ ПустаяСтрока(ТекстМодуля) Тогда
			
		Для Каждого Паттерн Из ПаттерныКонфликтов Цикл
			ШаблонПоиска = Новый РегулярноеВыражение(Паттерн);
			ШаблонПоиска.Многострочный = Ложь;
		
			Совпадения = ШаблонПоиска.НайтиСовпадения(ТекстМодуля);
			Если Совпадения.Количество() > 0 Тогда
				ТекстОшибки = СтрШаблон("'%1': %2 шт", Паттерн, Совпадения.Количество());
				Лог.Отладка(ТекстОшибки);
				Ошибки.Добавить(ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
		ТекстОшибки = СтрШаблон("В файле '%1' обнаружены ошибки объединения или перемещения веток: %2", ПутьКФайлуМодуля, ТекстОшибки);
		Лог.Ошибка(ТекстОшибки);
				
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры
