&НаКлиенте
#rEGION СлужебныеПроцедурыИФункции

#Вставка
#EndInsert
#КонецОбласти

&НаКлиентеНаСервереБезКонтекст

	// #КонецЕсли не влияет

#Если Сервер Или Клиент Тогда // и это не влияет

#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда

#ИначеЕсли Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

	#Если (МобильноеПриложениеКлиент И МобильноеПриложениеСервер Тогда)
	#Иначе    	
	#КонецЕсли				

	#Если НаКлиенте ИЛИ НаСервере Тогда
	#ИначеЕсли ВнешнееСоединение
	#КонецЕсли


	#IF Сервер ИЛИ НЕ clIent
	#ИначеЕсли Server
	#Иначе    	
	#endif

#Delete
#Область СлужебныеПроцедурыИФункции
&ВнешнееСоединение
&ТонкийКлиент
&ВебКлиент
#КонецОбласти

#КонецУдаления

#else // Если Всегда

#КонецЕсли

