&НаКлиенте
#Область СлужебныеПроцедурыИФункции

#КОНЕЦОбласти

&НаКлиентеНаСервереБезКонтекст

#ИНАЧЕЕсли

#ИНАЧЕЕсли ТолстыйКлиентУправляемоеПриложениюю

#ИНАЧЕЕсли (ТолстыйКлиентУправляемоеПриложениюю и ТолстыйКлиентОбычноеПриложение)

#Если (МобильноеПриложениеКлиент ИЛИ МобильноеПриложениеСервер Тогда)
#ИначеЕсли (ТолстыйКлиентОбычноеПриложение ИЛИ НЕ ТолстыйКлиентУправляемоеПриложение)
#Иначе
#КонецЕсли

#Если НаКлиент ИЛИ НаСервер
#КонецЕсли


#Если Сервере ИЛИ НЕ Клиенте
#КонецЕсли

#Область СлужебныеПроцедурыИФункции
&ВнешнееСоединение
&ТонкийКлиент
&ВебКлиент
#КонецОбласти