///////////////////////////////////////////////////////////////////////////////
//
// Служебный модуль с реализацией работы команды <exec-rules>
//
// (с) BIA Technologies, LLC
//
///////////////////////////////////////////////////////////////////////////////

#Использовать gitrunner

Перем Лог;
Перем РепозиторийGit;

///////////////////////////////////////////////////////////////////////////////

Процедура НастроитьКоманду(Знач Команда, Знач Парсер) Экспорт
	
	// Добавление параметров команды
	Парсер.ДобавитьПозиционныйПараметрКоманды(Команда, "КаталогРепозитория",
		"Каталог анализируемого репозитория");
	Парсер.ДобавитьПозиционныйПараметрКоманды(Команда, "Коммит1",
		"Идентификатор коммита. Если указан, анализируются только файлы, измененные коммитом.
		| Если это merge-request, то изменения между двумя родительскими коммитами.");
	Парсер.ДобавитьПозиционныйПараметрКоманды(Команда, "Коммит2",
		"Идентификатор коммита. Если указан, то анализируются только файлы, которые отличаются
		| между двумя указанными коммитами.");
	Парсер.ДобавитьПараметрФлагКоманды(Команда, "-staged-only",
		"Флаг, ограничивающий список обрабатываемых файлов добавленными в индекс git.");
	Парсер.ДобавитьИменованныйПараметрКоманды(Команда, "-source-dir",
		"Каталог расположения исходных файлов относительно корня репозитория.
		| Если сценариев несколько,  указываются в кавычках через , . По умолчанию <src>");
	Парсер.ДобавитьИменованныйПараметрКоманды(Команда, "-rules",
		"Перечень правил для применения. Если сценариев несколько,  указываются в кавычках через ,");
	Парсер.ДобавитьИменованныйПараметрКоманды(Команда, "-cfg-file",
		"Путь к конфигурационному файлу с настройками. Если не указан, используются настройки репозитория либо глобальные");
	
КонецПроцедуры // НастроитьКоманду

// Выполняет логику команды
//
// Параметры:
//   ПараметрыКоманды - Соответствие - Соответствие ключей командной строки и их значений
//   Приложение - Модуль - Модуль менеджера приложения
//
Функция ВыполнитьКоманду(Знач ПараметрыКоманды, Знач Приложение) Экспорт

	Параметры = ПараметрыВыполнения(ПараметрыКоманды, Приложение);
	Если Параметры = Неопределено Тогда
		Возврат Приложение.РезультатыКоманд().НеверныеПараметры;
	КонецЕсли;

	Лог = Параметры.Лог;
	НастройкиИБ = Параметры.НастройкиИБ;
	КаталогРепозитория = Параметры.КаталогРепозитория;
	АдресПоискаКонфигурационногоФайла = Параметры.КаталогКонфигурационногоФайла;
	ИменаЗагружаемыхСценариев = Параметры.Сценарии;
	ЗатребованныеСценарии = Параметры.ИменаСценариев;
	ОбрабатываемыеФайлы = Параметры.ОбрабатываемыеФайлы;
	
	УправлениеНастройками = МенеджерНастроек.НастройкиРепозитория(АдресПоискаКонфигурационногоФайла);
	
	ЭтоПринудительноеВыполнениеУказанныхПравил = Ложь;
	Если ЗначениеЗаполнено(ИменаЗагружаемыхСценариев) Тогда
		Лог.Отладка("КомандаВыполнитьСценарии.ВыполнитьКоманду(): Перед выполнением СценарииОбработки.ПолучитьСценарииСПараметрамиВыполнения(): ИменаЗагружаемыхСценариев = " + СтрСоединить(ИменаЗагружаемыхСценариев,";"));
		ЭтоПринудительноеВыполнениеУказанныхПравил = Истина; // Выполнение по явному указанию по -rules
	Иначе
		Лог.Отладка("КомандаВыполнитьСценарии.ВыполнитьКоманду(): Перед выполнением СценарииОбработки.ПолучитьСценарииСПараметрамиВыполнения(): ИменаЗагружаемыхСценариев = Пустые");
	КонецЕсли;
	
	НаборНастроек = СценарииОбработки.ПолучитьСценарииСПараметрамиВыполнения(КаталогРепозитория, ИменаЗагружаемыхСценариев, ЭтоПринудительноеВыполнениеУказанныхПравил);

	
	ПараметрыОбработки = СценарииОбработки.ПолучитьСтандартныеПараметрыОбработки();
	ПараметрыОбработки.Лог = Лог;
	ПараметрыОбработки.НастройкиИБ = НастройкиИБ;
	ПараметрыОбработки.ЗатребованныеСценарии = ЗатребованныеСценарии;
	ПараметрыОбработки.КаталогРепозитория = КаталогРепозитория;
	
	Ошибки = Новый Массив;

	СценарииОбработки.ВыполнитьОбработкуФайлов(ОбрабатываемыеФайлы, НаборНастроек, ПараметрыОбработки, Ошибки);
	
	// В отличие от прекоммита, здесь лучше вывести все криты в конце одним блоком еще раз.
	Если Ошибки.Количество() Тогда
		Лог.Ошибка("В результате выполнения возникли исключения:");
		Для Каждого ОписаниеОшибки Из Ошибки Цикл
			Лог.Ошибка(ОписаниеОшибки);
		КонецЦикла;
	КонецЕсли;
	
	// При успешном выполнении возвращает код успеха
	Возврат Приложение.РезультатыКоманд().Успех;
	
КонецФункции // ВыполнитьКоманду

Функция РепозиторийGit(КаталогРепозитория = "")
	Если РепозиторийGit = Неопределено Тогда
		РепозиторийGit = Новый ГитРепозиторий;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(КаталогРепозитория) И РепозиторийGit.ПолучитьРабочийКаталог() <> КаталогРепозитория Тогда
		РепозиторийGit.УстановитьРабочийКаталог(КаталогРепозитория);
	КонецЕсли;

	Возврат РепозиторийGit;
КонецФункции

Функция ПараметрыВыполнения(ПараметрыКоманды, Приложение)
	Лог = Приложение.ПолучитьЛог();
	НастройкиИБ = Приложение.ПолучитьНастройкиИБ();
    КаталогРепозитория = ЗначениеПараметра(ПараметрыКоманды, "КаталогРепозитория", "");
	Если НЕ ЭтоСуществующийКаталог(КаталогРепозитория) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбрабатываемыеОбъекты = ОбрабатываемыеОбъекты(ПараметрыКоманды, КаталогРепозитория);
	
	КаталогКонфигурационногоФайла = ЗначениеПараметра(ПараметрыКоманды, "-cfg-file", КаталогРепозитория);

	Сценарии = Неопределено;
	ИменаСценариев = Новый Массив;
	ПараметрИменаЗагружаемыхСценариев = ЗначениеПараметра(ПараметрыКоманды, "-rules");
	Если ЗначениеЗаполнено(ПараметрИменаЗагружаемыхСценариев) Тогда
		ПараметрИменаЗагружаемыхСценариев = СтрЗаменить(ПараметрИменаЗагружаемыхСценариев, " ", "");
		Сценарии = СтрРазделить(ПараметрИменаЗагружаемыхСценариев, ",", Ложь);
		ИменаСценариев = СтрРазделить(СтрЗаменить(ПараметрИменаЗагружаемыхСценариев, ".os", ""), ",", Ложь);
	КонецЕсли;

	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Лог", Лог);
	ПараметрыВыполнения.Вставить("НастройкиИБ", НастройкиИБ);
	ПараметрыВыполнения.Вставить("КаталогРепозитория", КаталогРепозитория);
	ПараметрыВыполнения.Вставить("КаталогКонфигурационногоФайла", КаталогКонфигурационногоФайла);
	ПараметрыВыполнения.Вставить("Сценарии", Сценарии);
	ПараметрыВыполнения.Вставить("ИменаСценариев", ИменаСценариев);
	ПараметрыВыполнения.Вставить("ОбрабатываемыеФайлы", ОбрабатываемыеОбъекты);
	
	Возврат ПараметрыВыполнения;
КонецФункции

Функция ЗначениеПараметра(НаборПараметров, ИмяПараметра, ЗначениеПоУмолчанию = Неопределено)
	Значение = НаборПараметров[ИмяПараметра];
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ОбрабатываемыеОбъекты(ПараметрыКоманды, КаталогРепозитория)
	ОбрабатыватьТолькоИндексированныеФайлы = ЗначениеПараметра(ПараметрыКоманды, "-staged-only", Ложь);
	КаталогиИсходныхФайлов = КаталогиИсходныхФайлов(ПараметрыКоманды);
	Коммиты = МассивКоммитов(ПараметрыКоманды, КаталогРепозитория);
	
	ТаблицаФайлов = СценарииОбработки.НоваяТаблицаОбрабатываемыхФайлов();
	Если НЕ ОбрабатыватьТолькоИндексированныеФайлы И Коммиты.Количество() = 0 Тогда
		ДобавитьВсеИсходныеФайлы(ТаблицаФайлов, КаталогРепозитория, КаталогиИсходныхФайлов);
	Иначе
		// Обрабатываются файлы, добавленные в индекс git, либо измененные между двумя коммитами или merge-request'ом
		Изменения = ?(ОбрабатыватьТолькоИндексированныеФайлы,
			СписокИндексированныхФайлов(КаталогРепозитория),
			СписокИзмененийМеждуКоммитами(Коммиты, КаталогРепозитория));

		Для Каждого ИмяФайла Из Изменения Цикл
			Для Каждого КаталогИсходныхФайлов Из КаталогиИсходныхФайлов Цикл
				ТекущийКаталогИсходныхФайлов = ОбъединитьПути(КаталогРепозитория, СокрЛП(КаталогИсходныхФайлов));
				ДобавитьОбрабатываемыйОбъект(ТаблицаФайлов, ИмяФайла, ТекущийКаталогИсходныхФайлов);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Возврат ТаблицаФайлов;
КонецФункции

Функция КаталогиИсходныхФайлов(ПараметрыКоманды)
	ПараметрКаталогиИсходныхФайлов = ЗначениеПараметра(ПараметрыКоманды, "-source-dir", "src");
	КаталогиИсходныхФайлов = СтрРазделить(ПараметрКаталогиИсходныхФайлов, ",", Ложь);

	Результат = Новый Массив;
	Для Каждого Каталог Из КаталогиИсходныхФайлов Цикл
		Если ЭтоСуществующийКаталог(Каталог) Тогда
			Результат.Добавить(Каталог);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции

Процедура ДобавитьОбрабатываемыйОбъект(Коллекция, Знач Файл, Знач Каталог, ТипИзменения = Неопределено)
	ОбрабатываемыйФайл = ФайловыеОперации.НовыйФайл(Файл);
	
	Если НЕ ФайловыеОперации.ФайлНаходитсяВКаталоге(Файл, Каталог) Тогда
		Возврат;
	КонецЕсли;

	Если ТипИзменения = Неопределено Тогда
		ТипИзменения = ВариантИзмененийФайловGit.Изменен;
	КонецЕсли;

	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Файл = ОбрабатываемыйФайл;
	НоваяСтрока.Каталог = Каталог;
	НоваяСтрока.ТипИзменения = ТипИзменения;
КонецПроцедуры

Функция ЭтоСуществующийКаталог(Каталог)
	КаталогОбъект = Новый Файл(Каталог);
	Если НЕ КаталогОбъект.Существует() Тогда
		Лог.Ошибка("Каталог <%1> не существует", Каталог);
		Возврат Ложь;
	ИначеЕсли НЕ КаталогОбъект.ЭтоКаталог() Тогда
		Лог.Ошибка("Каталог <%1> является файлов", Каталог);
		Возврат Ложь;
	Иначе
		Каталог = КаталогОбъект.ПолноеИмя;
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция МассивКоммитов(ПараметрыКоманды, КаталогРепозитория)
	Коммиты = Новый Массив;
	Репозиторий = РепозиторийGit(КаталогРепозитория);
	Если НЕ Репозиторий.ЭтоРепозиторий() Тогда
		Возврат Коммиты;
	КонецЕсли;

	Коммит1 = ЗначениеПараметра(ПараметрыКоманды, "Коммит1", "");
	Если НЕ ПустаяСтрока(Коммит1) Тогда
		Коммит2 = ЗначениеПараметра(ПараметрыКоманды, "Коммит2", "");
		Если ПустаяСтрока(Коммит2) Тогда
			Коммиты = РодительскиеКоммиты(Коммит1);
		Иначе
			Коммиты.Добавить(Коммит1);
			Коммиты.Добавить(Коммит2);
		КонецЕсли;
	КонецЕсли;

	Возврат Коммиты;
КонецФункции

Функция РодительскиеКоммиты(Коммит)
	Коммиты = Новый Массив;
	Git = РепозиторийGit();
	Git.ВыполнитьКоманду(МассивПараметров("cat-file", "-p", Коммит));
	Результат = Git.ПолучитьВыводКоманды();

	РегулярноеВыражение = Новый РегулярноеВыражение("parent (\w+)");
	Совпадения = РегулярноеВыражение.НайтиСовпадения(Результат);
	Если НЕ ДваЭлементаВКоллекции(Совпадения) Тогда
		Лог.Ошибка("В команду необходимо передать два коммита или коммит с двумя родителями (объединение веток).");
		ВызватьИсключение "Не удалось составить список измененных файлов коммита";
	КонецЕсли;

	Для Каждого Совпадение Из Совпадения Цикл
		Группа = Совпадение.Группы[1];
		Коммиты.Добавить(Группа.Значение);
	КонецЦикла;

	Возврат Коммиты;
КонецФункции

Функция МассивПараметров(Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
	Массив = Новый Массив;
	Массив.Добавить(Параметр1);

	Если Параметр2 <> Неопределено Тогда
		Массив.Добавить(Параметр2);
	КонецЕсли;
	Если Параметр3 <> Неопределено Тогда
		Массив.Добавить(Параметр3);
	КонецЕсли;
	Если Параметр4 <> Неопределено Тогда
		Массив.Добавить(Параметр4);
	КонецЕсли;

	Возврат Массив;
КонецФункции

Процедура ДобавитьВсеИсходныеФайлы(ТаблицаФайлов, КаталогРепозитория, Каталоги)
	Для Каждого Каталог Из Каталоги Цикл
		ТекущийКаталог = ОбъединитьПути(КаталогРепозитория, СокрЛП(Каталог));
		Если НЕ ЭтоСуществующийКаталог(ТекущийКаталог) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеФайлы = НайтиФайлы(ТекущийКаталог, ПолучитьМаскуВсеФайлы(), Истина);
		Для Каждого Файл Из НайденныеФайлы Цикл
			ДобавитьОбрабатываемыйОбъект(ТаблицаФайлов, Файл, Каталог);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция СписокИзмененийМеждуКоммитами(Коммиты, КаталогРепозитория)
	Если НЕ ДваЭлементаВКоллекции(Коммиты) Тогда
		Возврат СценарииОбработки.НоваяТаблицаОбрабатываемыхФайлов();
	КонецЕсли;

	ПараметрыКоманды = МассивПараметров(СтрШаблон("diff --name-status --no-renames %1 %2", Коммиты[0], Коммиты[1]));
	Возврат ИзмененияРепозитория(КаталогРепозитория, ПараметрыКоманды);
КонецФункции

Функция СписокИндексированныхФайлов(КаталогРепозитория)
	ПараметрыКоманды = МассивПараметров("diff --name-status --staged --no-renames");
	Возврат ИзмененияРепозитория(КаталогРепозитория, ПараметрыКоманды);
КонецФункции

Функция ИзмененияРепозитория(КаталогРепозитория, ПараметрыКоманды)
	ТаблицаФайлов = СценарииОбработки.НоваяТаблицаОбрабатываемыхФайлов();
	
	Git = РепозиторийGit(КаталогРепозитория);
	Git.ВыполнитьКоманду(ПараметрыКоманды);
	Результат = Git.ПолучитьВыводКоманды();

	Если ПустаяСтрока(Результат) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	ИзмененныеФайлы = СтрРазделить(СокрЛП(Результат), Символы.ПС);
	Для Каждого СтрокаФайла Из ИзмененныеФайлы Цикл
		Если ПустаяСтрока(СтрокаФайла) Тогда
			Продолжить;
		КонецЕсли;

		ДанныеФайла = ВариантИзмененийФайловGit.РазделитьИмяФайлаИВариантИзменения(СтрокаФайла);
		ПутьКФайлу = ОбъединитьПути(КаталогРепозитория, СокрЛП(ДанныеФайла.ИмяФайла));
		Файл = ФайловыеОперации.НовыйФайл(ПутьКФайлу);
		ДобавитьОбрабатываемыйОбъект(ТаблицаФайлов, Файл, КаталогРепозитория, ДанныеФайла.ТипИзменения);
	КонецЦикла;

	Возврат ТаблицаФайлов;
КонецФункции

Функция ДваЭлементаВКоллекции(Коллекция)
	ЗначениеСравнения = 2;
	Возврат Коллекция.Количество() = ЗначениеСравнения;
КонецФункции
